young-ciceros-path.org
* drafts of sections
** quick outline
began far back (early 80s), chugged around (friends with computers)
until the 90s and music editing software. Exploded my brain (2008),
took over my life (2011), led to my first computing gig (2013).

The most crucial juncture is the point at which it went from being
fun, to alienating and disturbing, to liberating and
reinvigoratin. Miller Puckette's work, Pd, and the community around
it, as exemplfied by Pd-extended, were critical. I'll describe a few
useful things here. 

The next big thing was emacs.

** jumping in
   
let me start...not so much autobiographically, but in taking myself
to be a kind of case study. With a brief description of what I
wanted to do, what I have found myself doing, and what I feel like
I have learned. Such a personal approach has its drawbacks, of
course: what do you care what I did? and how could it even help
you, when what you want to do is not what I did? and just who the
hell do I think I am? Some explanation is in order, if nothing else,
to gain the sympathy of the dubious reader.

** problems with tutorials
    CLOCK: [2013-08-21 Wed 15:09]--[2013-08-21 Wed 15:10] =>  0:01

    in many ways, what you are reading is a reflection of my personal
    interests and actitivies during my time in PIMA ("Everything I Really Needed to Know I Read in a Tutorial
    at PIMA").

    There are a great many virtues to working independently through
    tutorials (at least for some people), but there will also be a great many hours spent
    looking for the relevant information, or trying to figure out what
    the relevant information even means.
    
    But here's an example problematic scenario. In order to use
    software X, you have to have software Y. But in order to get
    software Y, you have to know how to use some software Z that is
    easy to find but hard to use to get software Y unless you already
    know to use it. Thus, to get software X to do the awesome thing
    you just thought of in an inspired vision, you have to jump
    through several hoops that are nowhere near as beautiful or
    exciting as the great idea you just had and are already
    forgetting.

    If this doesn't sound familiar, my guess is one of two things is
    likely: 

    1. either you don't need to ever read this because you have
    already jumped through every cognitive hoop with relative ease;
    2. or else you haven't yet spent enough time at
    a computer, or don't care to.

** observations of a musician in media art
    Whatever the case, one idea here is simply to talk about some
    pieces of software that you may or may not have come across, but
    which I have found useful, or interesting, largely during my time
    as a peculiar student in the MFA program at Brooklyn College's Performance and
    Interactive Media Art. 

    As a musician, my
    experience has been most extensive with audio applications--but
    a larger thesis, which I can only hint at here, is that the information that I have (or you may)
    acquired working through the software related to your medium can
    form an entry, if not a foundation, for doing ANYTHING. Moreover, if
    you are patient enough to learn how to use some new technology,
    than I warrant that you have a skill that could be useful beyond
    the scope of whatever your immediate goal was. You could learn to
    do some things that may be even more useful (in a world that
    hasn't yet created a home for your peculiar artistic idea, activity
    artifact or intellectual construct! Sound enticing? Here are links
    to some specifics.

** the purpose of a (this?) tutorial
[2013-11-06 Wed 17:55]
From what I've gathered, in my patient saga of autodidacticism, the
ostensible purpose of a tutorial is not to show one person how to do
one thing, but to cast as wide a net as possible. Not to unwittingly
continue the metaphor, but the old saw of "teach a man to fish..."
seems relevant: you need to show someone how to do things that will
ultimately help them do WHATEVER they want at some point in the
hopefully not too far off future. Since this can be hard to do,
there's a temptation in writing a tutorial to instead simply do the
fishing for the reader--to show them exactly what you did, so they can
do that one thing. Which may seem rather myopic and entirely too much
like simply giving a man a fish.

But here's where the metaphor breaks down, and must unremorsefully
be abandoned. Imitation--walking yourself through the steps that
somebody else went through--is actually one of the best ways to
start out. As acute observers of human behavior will note,
following comes quite naturally to us humans; we excel at watching
and borrowing. And in an autodidactic situation, it is a skill that
has much to recommend it. You do not have to give birth, fully
formed, to your own mental plan of how to carry out exactly what
you want to do, but can instead look at how to modify or deviate
from one model that at least has the virtue of having already
succeeded at some point. To venture one more perhaps strained
analogy, it's like the difference between giving somebody a book on
how to get rich versus actually giving somebody a job; sure, they
might appreciate the fact that you want them to ultimately succeed
at the highest level, but there are a whole lot more immediate
concerns. A vast capital empire begins with a single commodity
exchange...thus, bringing to an end my string of strained analogies
and paraphrases of adages.

** initial encounters with the "free vs. open" theme
   

   I have historically been a musician, primarily. But I began this
   project out of a sense of having spent a great deal of time over
   the last two years not playing music: instead, I was poking around
   my computer and any tutorials I could find, desperately trying to
   understand how to do _something_. And as a _freelance_ musician,
   this something typically involved using free software--or better
   yet, trying to LEARN how to get, install and use free software. Why
   "free?" Well, it turns out that a simple question like this has a
   long history. And the possible responses have more than enough
   complications to take us largely beyond the scope of this writing,
   which is about how to find your way around the free software world,
   not "why" you might need to do that in the first place. I'll
   address the 'free' issue soon enough.
   
