young-ciceros-path.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>young-ciceros-path</title>
<!-- 2013-12-16 Mon 21:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="WORZONE"/>
</head>
<body>
<div id="content">
<h1 class="title">young-ciceros-path</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. drafts of sections</a>
<ul>
<li><a href="#sec-1-1">1.1. quick outline</a></li>
<li><a href="#sec-1-2">1.2. jumping in</a></li>
<li><a href="#sec-1-3">1.3. problems with tutorials</a></li>
<li><a href="#sec-1-4">1.4. observations of a musician in media art</a></li>
<li><a href="#sec-1-5">1.5. the purpose of a (this?) tutorial</a></li>
<li><a href="#sec-1-6">1.6. initial encounters with the "free vs. open" theme</a></li>
<li><a href="#sec-1-7">1.7. breaking with tutorial style and etiquette</a></li>
<li><a href="#sec-1-8">1.8. the artist's voice</a></li>
<li><a href="#sec-1-9">1.9. gearing up to "think like a computer scientist"</a>
<ul>
<li><a href="#sec-1-9-1">1.9.1. data-driven</a></li>
<li><a href="#sec-1-9-2">1.9.2. it's ok</a></li>
<li><a href="#sec-1-9-3">1.9.3. a question of audience</a></li>
<li><a href="#sec-1-9-4">1.9.4. learning</a></li>
</ul>
</li>
<li><a href="#sec-1-10">1.10. analogies</a></li>
<li><a href="#sec-1-11">1.11. using CL-interfaces vs. GU-interfaces</a></li>
<li><a href="#sec-1-12">1.12. reflections about reading programming</a></li>
<li><a href="#sec-1-13">1.13. putting the "source" in open source</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> drafts of sections</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> quick outline</h3>
<div class="outline-text-3" id="text-1-1">
<p>
began far back (early 80s), chugged around (friends with computers)
until the 90s and music editing software. Exploded my brain (2008),
took over my life (2011), led to my first computing gig (2013).
</p>

<p>
The most crucial juncture is the point at which it went from being
fun, to alienating and disturbing, to liberating and
reinvigoratin. Miller Puckette's work, Pd, and the community around
it, as exemplfied by Pd-extended, were critical. I'll describe a few
useful things here. 
</p>

<p>
The next big thing was emacs.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> jumping in</h3>
<div class="outline-text-3" id="text-1-2">
<p>
let me start&#x2026;not so much autobiographically, but in taking myself
to be a kind of case study. With a brief description of what I
wanted to do, what I have found myself doing, and what I feel like
I have learned. Such a personal approach has its drawbacks, of
course: what do you care what I did? and how could it even help
you, when what you want to do is not what I did? and just who the
hell do I think I am? Some explanation is in order, if nothing else,
to gain the sympathy of the dubious reader.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> problems with tutorials</h3>
<div class="outline-text-3" id="text-1-3">
<p>
in many ways, what you are reading is a reflection of my personal
interests and actitivies during my time in PIMA ("Everything I Really Needed to Know I Read in a Tutorial
at PIMA").
</p>

<p>
There are a great many virtues to working independently through
tutorials (at least for some people), but there will also be a great many hours spent
looking for the relevant information, or trying to figure out what
the relevant information even means.
</p>

<p>
But here's an example problematic scenario. In order to use
software X, you have to have software Y. But in order to get
software Y, you have to know how to use some software Z that is
easy to find but hard to use to get software Y unless you already
know to use it. Thus, to get software X to do the awesome thing
you just thought of in an inspired vision, you have to jump
through several hoops that are nowhere near as beautiful or
exciting as the great idea you just had and are already
forgetting.
</p>

<p>
If this doesn't sound familiar, my guess is one of two things is
likely: 
</p>

<ol class="org-ol">
<li>either you don't need to ever read this because you have
</li>
</ol>
<p>
already jumped through every cognitive hoop with relative ease;
</p>
<ol class="org-ol">
<li>or else you haven't yet spent enough time at
</li>
</ol>
<p>
a computer, or don't care to.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> observations of a musician in media art</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Whatever the case, one idea here is simply to talk about some
pieces of software that you may or may not have come across, but
which I have found useful, or interesting, largely during my time
as a peculiar student in the MFA program at Brooklyn College's Performance and
Interactive Media Art. 
</p>

<p>
As a musician, my
experience has been most extensive with audio applications&#x2013;but
a larger thesis, which I can only hint at here, is that the information that I have (or you may)
acquired working through the software related to your medium can
form an entry, if not a foundation, for doing ANYTHING. Moreover, if
you are patient enough to learn how to use some new technology,
than I warrant that you have a skill that could be useful beyond
the scope of whatever your immediate goal was. You could learn to
do some things that may be even more useful (in a world that
hasn't yet created a home for your peculiar artistic idea, activity
artifact or intellectual construct! Sound enticing? Here are links
to some specifics.
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> the purpose of a (this?) tutorial</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2013-11-06 Wed 17:55]</span></span>
From what I've gathered, in my patient saga of autodidacticism, the
ostensible purpose of a tutorial is not to show one person how to do
one thing, but to cast as wide a net as possible. Not to unwittingly
continue the metaphor, but the old saw of "teach a man to fish&#x2026;"
seems relevant: you need to show someone how to do things that will
ultimately help them do WHATEVER they want at some point in the
hopefully not too far off future. Since this can be hard to do,
there's a temptation in writing a tutorial to instead simply do the
fishing for the reader&#x2013;to show them exactly what you did, so they can
do that one thing. Which may seem rather myopic and entirely too much
like simply giving a man a fish.
</p>

<p>
But here's where the metaphor breaks down, and must unremorsefully
be abandoned. Imitation&#x2013;walking yourself through the steps that
somebody else went through&#x2013;is actually one of the best ways to
start out. As acute observers of human behavior will note,
following comes quite naturally to us humans; we excel at watching
and borrowing. And in an autodidactic situation, it is a skill that
has much to recommend it. You do not have to give birth, fully
formed, to your own mental plan of how to carry out exactly what
you want to do, but can instead look at how to modify or deviate
from one model that at least has the virtue of having already
succeeded at some point. To venture one more perhaps strained
analogy, it's like the difference between giving somebody a book on
how to get rich versus actually giving somebody a job; sure, they
might appreciate the fact that you want them to ultimately succeed
at the highest level, but there are a whole lot more immediate
concerns. A vast capital empire begins with a single commodity
exchange&#x2026;thus, bringing to an end my string of strained analogies
and paraphrases of adages.
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> initial encounters with the "free vs. open" theme</h3>
<div class="outline-text-3" id="text-1-6">
<p>
I have historically been a musician, primarily. But I began this
project out of a sense of having spent a great deal of time over
the last two years not playing music: instead, I was poking around
my computer and any tutorials I could find, desperately trying to
understand how to do <span class="underline">something</span>. And as a <span class="underline">freelance</span> musician,
this something typically involved using free software&#x2013;or better
yet, trying to LEARN how to get, install and use free software. Why
"free?" Well, it turns out that a simple question like this has a
long history. And the possible responses have more than enough
complications to take us largely beyond the scope of this writing,
which is about how to find your way around the free software world,
not "why" you might need to do that in the first place. I'll
address the 'free' issue soon enough.
</p>
</div>
</div>
