young-ciceros-path.html
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> breaking with tutorial style and etiquette</h3>
<div class="outline-text-3" id="text-1-7">
<p>
To any experienced reader of software tutorials, the sheer length
at which I have gone on in what is just a preface will may mark
this writing as being NOT FOR THEM. That may be entirely true. The
raison d'etre, if you will, for this tutorial is to make it easier
for anybody who is not used to sitting down to a highly compressed,
gnomic explanation of the specifications of some perhaps highly
abstract bit of technical knowhow. David Foster Wallace has pointed
out an irony of guides to English usage: that the people who need
them the most are not the people most likely to buy them. Something
similar can be said about software tutorials: the people most
likely to be well-versed enough to actually write one are perhaps
the least likely to be helpful. Since they have already progressed
so far from the initial stages that their readers will be starting
from, they may not necessarily be well-suited for the
characterisitc most required for good instruction: empathy. And
we're not talking just any kind of empathy here. We're talking
about an ability to finely calibrate one's demeanor and explanatory
style to fit the needs of the individual. Considering that this
ability must also come with a commmand of the more abstract aspects
of the subject matter and the problem emerges quite clearly. At the
risk of invoking an all-too-vague and frequently unhelpful word,
the intelligences that are required are emotional as well as verbal
or logical. And I don't know about you, but I've noticed that there
are no rules for how these things are apportioned among people, or
within even a given person.
</p>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> the artist's voice</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Much of this prefacing could be summed by saying that this is a
tutorial, which sometimes digresses on technical matters, BY an
artist and FOR artists. I thus make as few assumptions as possible
about how much you, as an artist, already know about the matters at
hand. I do assume, however, that like myself, you have as much of
the qualities that make for a great humanist as great
technician. That is, that you were as likely to have been trained
in a "human" art form as a "technical" one.
</p>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> gearing up to "think like a computer scientist"</h3>
<div class="outline-text-3" id="text-1-9">
<p>
there is no shortage of books for teaching yourself "x." In fact,
there's even something called "Learn X the Hard Way," which is
mostly about learning to program in some computer language X of
your choice.
</p>

<p>
There are several differences here:
</p>
<ol class="org-ol">
<li>This is not about learning to program in a specific language,
per se.
</li>

<li>This is written for artists by an artist, with input from
other artists.

<p>
2.1 This is significant because it gives this audience a more
</p>
</li>
</ol>
<p>
defineable shape, though it by no means limits the heterogeneity
of the readers
</p>


<ol class="org-ol">
<li>It assumes that artists are intelligent, sensitive, and extremely
well-versed in some particular domain, one that may even
involve extensive use of a computer.
</li>
</ol>

<p>
Perhaps most significantly,
</p>

<ol class="org-ol">
<li>It assumes that artists are not used to thinking about or
using the concept of "data" in their day-to-day work.
</li>
</ol>
</div>


<div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1"><span class="section-number-4">1.9.1</span> data-driven</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
The emphasis on data placed here is significant because, unlike
humans, computers are not good at intuiting what we mean, or
what we might be thinking. You could argue that nor are all
humans, but at least we have evolved to be at least capable of
such intuitions. Computers, or at least the ones artists are
likely to avail themselves of in the era of this writing, are
designed not to be human-like at inferring what we mean, but to
be good at dealing with data. 
</p>

<p>
This is, of course, purposefully vague. Because part of the point
about data is that the concept is stripped of nearly all
detail&#x2013;the word in Latin simply refers to that which is
given. Which is being pretty vague, indeed. 
</p>

<p>
While all humans may be slightly perplexed by this concept&#x2013;
data&#x2013;artists may be more likely to not just be befuddled or
nonplussed but downright vexed or resentful! To begin with, data
is a plural word that often feels like it should be singular, so
we already get off to a bad start once we have to talk about what
data is&#x2026;I mean, "are." Furthermore, data typically is/are what
you enter when you get your first entry-level temp job; data
is/are what you plot on a graph in math class. Data is banking,
and statistics, and scientific method, and everything seemingly
inimical to what English Romantic poets like Blake and Wordsworth
brought to consciousness hundreds of years of ago. 
</p>

<p>
At least, this thought can't help but surface if you have spent
much time thinking about that time period in Western art and
literature. This condition is increasingly less easy to take for
granted in 2013, which suggests that the themes such artists were
concerned with are less relevant now. The validity of the above
reasoning is not under discussion here, though. My purpose is
simply to state baldly that it is hard to imagine an adolescent
version of myself putting down my copy of Intimations of
Immortality in order to pick up and begin reading "How to think
like a computer scientist." Maybe that's just me. But
from what I have gathered about artists, or those with
artistic temperaments, thinking about the world&#x2013;to say nothing of
their own passions&#x2013;as somehow reducible to data is odd, or worse.
</p>
</div>
</div>
<div id="outline-container-sec-1-9-2" class="outline-4">
<h4 id="sec-1-9-2"><span class="section-number-4">1.9.2</span> it's ok</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
This, however, is evidently not the place to reconcile these ways
of looking at the world. Let it simply be known that it's primary
author was familiar with Heidegger's deeply skeptical, "The
Question Concerning Technology" long before he ever knew what a
command-line interface was. I hope that somehow that fact plays a
part in my humble attempt to help artists learn how to learn how
to install and run software. The circularity there is part of the
pleasure of having put down Wordsworth for some time now, in the
interest of learning something new.
</p>
</div>
</div>
