young-ciceros-path.org
*** a question of audience
    CLOCK: [2013-09-15 Sun 22:40]--[2013-09-15 Sun 22:47] =>  0:07
    
    one problem we sometimes face in life is appropriately tailoring our
    communication to a particular audience. In some cases, it is an
    audience that shares much of the same knowledge--for whatever
    reason, the speaker and the audience have a common context within
    which they can communicate, sometimes using shorthand
    expressions, or relying on assumptions that derive from similar
    experiences between people who otherwise may have little in common.

    This fairly describes many groups, but the techie world is
    especially known for often seeming impenterable to
    newcomers. This can be the case for people happen to just occupy
    different spheres of the tech world; programmers who work in one
    language or kind of technology can become very insular (look up
    "the editor wars" for an example). 

    People who are just developing their understanding of a
    technology can take heart from this fact--that what can seem like
    a peculiar in-language may still seem like that to people who are
    otherwise well-versed in other some particular branch of
    technology.

    Part of the problem, then, lies in how to begin developing that
    context for oneself. And for this there are few shortcuts. In
    fact, the initial discomfort and vexation that comes with
    learning a new vocabulary or new way of working can be such that
    it quite quickly and permanently dissuades viable canditates for
    learning from persisting long enough to see any fruits from their
    efforts.

    So let's think about what's required for the process of acquiring
    enough context for the language in a tutorial, or even at higher
    conceptual level, a way of thinking or working through a kind of
    system to seem helpful.

*** learning
    CLOCK: [2013-09-16 Mon 12:04]--[2013-09-16 Mon 12:33] =>  0:29

    One of the keys to confronting material that is in a strange
    "language" is to read and re-read. Doing so without breaks in
    between can, however, prove more frustrating than
    anything. Speculating on just why, I have always thought of a
    concept I read about in cognitive science: consolidating. This is
    sometimes used to refer to the process with the brain uses to
    acquire and retain memories. 

    This is not the place to go deeper into the mechanism by which
    this works, except to say that it appears to be connected to the
    way the brain processes at sub- or unconscious levels. A common
    experience is to have a name or thought "on the tip of my tongue"
    and yet, as long as one continues to "TRY" to remember the brain
    does not return the desired information.  It is only when one
    stops consciously TRYING to recall and instead moves on to
    another processing task that the missing word "pops up"
    miraculously. 

    Now, this should not be thought of as "consolidation" in
    action. Rather, it is a easy-to-relate-to example of brain
    functioning made nearly tangible. Learning anything new of
    sufficient strangeness or complexity involves both conscious and
    unconscious processes. Which is why perhaps the most important
    trait for helping oneself through the process is patience. Words
    like sedulous, tenacious, diligent, perserverance, resilient--all
    should give us a sense of what we can strive for. The feeling of
    frustration--of not getting it, even after repeated, persistent
    effort--is often sufficient to stymie a learner, and bring to a
    peremptory end "the learning process."

    So tuning in to the extremely small pleasures available to the
    sensitive learner, deriving some sense of satisifaction--however
    minor--from one's persistence is key. One of the best one's for
    me has always been just an increased sense of familiarity. This
    can be a perfectly adequate, if temporary, substitute for
    comprehension. Simply recognizing the material one was struggling
    to process the day before can be thought of as a kind of
    progress. 
** analogies
    for those of us who driven cars for any period of time, there are
    some hoary analogies lurking here, specifically that of the
    so-called "black box." This refers to any system the details of
    which have been hidden away from the typical user. And the
    typical user is typically content not knowing how a sparkplug
    works. Until something goes wrong. At which point, a range of
    possibilities present themselves, though you have to imagine a
    vast majority of us only see one: take the car to somebody who
    in fact knows how a sparkplug works. And more importantly, knows
    how to remove, replace and install one--delving into the black
    box that we treat as an abstract unit: the engine.

    There are a great many advantages to this system, which
    potentially make it not the most auspicious analogy for someone
    who wants to talk about the value of learning how software works.
    
