young-ciceros-path.org
** using CL-interfaces vs. GU-interfaces
The fact remains--most of us come to learn how to use computers by
interacting with graphic interfaces. That is, for many of us, the
most frequent experience we've had with computers has been based on
many other things beside pure text. In fact, seeing anything on a
computer screen which is primarily just text--no images, drop-down
menus or places to click--can be strange at first, or even
intimidating. 

It would, of course, be difficult to overestimate the effect that
"user-friendly" visual design has had on the popularity of personal
computing. Of course, what exactly constitutes 'friendly' varies
widely, depending on the person and the comfort level. Whatever your
personal predilections, the argument for developing text-based,
command line skills becomes increasingly persuasive as you want to do
have more control over what you can do. And as you spend more time
working with the things your software currently makes possible, the
more you may realize that you are developing a way of a working, a
personal computing style, in which you wish you could just do
X. Since with computers it's mostly a matter of knowing how to "tell"
your computer what you want it do, you will eventually need to learn
what kind of 'language' your computer understands (whatever the
deficiencies of this language, you can be assured it will not blush or bat
an eye at the torrent of vulgarities you direct at it when
frustrated). 

One effect of relying on software which lacks
limitations on how you can modify it is that--tada, you may be
EXPECTED to modify it!

All the ramifications of this fact may not be obvious at the moment,
except to say that modifying how something works usually requires some
UNDERSTANDING of _how_ it works. And this is one of the hidden topics
of this writing: how do we gain _understanding_, of anything
from software to the meaning of a word?

While this is necessarily a rather broad question, one way to
think about it at a relatively high level while keeping in mind the practical
imperatives of using software effectively is to develop one's
understanding of HOW software--any software--works. Now, this is an
enormous topic, but one way to simplify it is to point out that
software is typically made by people. It is WRITTEN; it is CREATED;
it is BUILT; it is DESIGNED. 

The emphasis here is to show that there is a process not dissimilar
to the ones artists and "non-computer people" have been using
throughout history--fabrication, for lack of less-loaded word. And if
it is _written_, than we might do well to consider the issue of
language, and the fact that, at some basic level, most software is
WRITTEN/CREATED/BUILT/DESIGNED by using a language.

Do we need to be experts on Language, or know everything that goes
into using or understanding a language in general? As interesting as
it may be to consider more deeply something all of us are literally
"conversant in," a person setting out to accomplish some small or
large task usually does not begin by considering all the rules and formal
properties that characterize the language required by the task (and
this goes as much for computer-based tasks as for more traditional
tasks).

However, we relative neophtyes might find it helpful to gain some
perspective on what we do when trying to use a computer to help us
accomplish our task, to create whatever we have in mind. And this perspective can be gained
very quickly by considering two phrases: machine language and natural
language. 

If you are like me, you may have little memory of the process of how
you acquired "language skills." But it almost certain that no one ever
used the phrase "natural language" while you were learning to speak, or
learning to read. And yet now, if we are to take this process of
learning just HOW some piece of software that we want to use works, we
must consider this very name for what we have been using as long as we
can remember. Why? Because the power that computers afford us derives
precisely from the fact that they rely on something very different
from natural language: "machine language."

The very phrase "machine language" should convey some impression of
what would be involved in developing a complete understanding of how
computers, and by extension, software works. For now, the best part is that
you do not have to have to learn to speak "machine language" to
undestand what it is, or how to tap into its power, to use software. 

However, to use software that requires, or better _affords_ you,
greater sophistication, we very much need to think about the gap
between these two "languages." One of the key things that bridges
that gap is another strange language: the programming language. 

What do you, who desires to use some piece of free software, need to
understand about this third kind of language? It is entirely
dependent on your goals. AND, unfortunately perhaps, on the goals of
the person who WROTE/CREATED/BUILT/DESIGNED the software that you are
interested in using, or at least learning more about.

Because at the time of this writing, late 2013, two distinct trends
co-exist in the increasingly technological society you most likely
inhabit. One is caused by this reliance on technology, and
specifically on computers, or better, so-called _personal_
computers. As computers continue to proliferate, there seems to be no
shortage of demand for them. Which means that there is more demand
for the software that drives them, and which we know--natch--is
typically written by people like you and me. This suggests that more
people will be involved in writing this software. 

Or maybe not. Maybe it's
just that fewer people will be involved in the kinds of activity
which we called manual labor, but will use computers with the same
understanding of the underlying mechanics of them that the average farmer had of
the internal combustion engine that propelled his tractor (apologies to all
farmers reading this who have more knowledge of the ICE than I am
assuming). This points to the
second trend. 

As computers become ever more popular and widespread,
one design philosophy sees to it that they are built to be "easier to use." One
way to think about that is that more control is being built into the
software on computers themselves, so that operating one requires as
little knowledge as possible. One only needs to have seen a toddler
"swipe" a touchscreen to comprehend this trend.

So where should we position ourselves with respect to this dichotomy?
Between the options of more intuitive design on the one hand and more well-versed
users on the other? The purpose of this writing is not to take sides, or even
think much about whether it is a legitmate questions at all. We are
simply here to use software that allows us to do whatever we want
with it, provided we have the requisite skills. 

And so because these skills in the end do have something to do with
language, like so many forms of our knowledge, it behooves us to
think about the existing means we have for dealing with languages,
and specifically dealing with them on the computer. This may not be
the same thing as learning a programming language (which may or may
not be equivalent to "learning to program"), but it should make it
easier to understand some of what is involved in such languages, at
least as far as getting the most out of free software is concerned. 

So let's begin with a simple fact: in that space between machine and
natural language that is the programming language are symbols that look vaguely familiar. Those of us
who spent much time digging into computers or books on computing may
even have come across things like the following:

#+BEGIN_SRC C
  insertion_sort(item s[], int n)
  {
    int i, j; /* counters */
  
    for (i=1; i<n: i++) {
      j=i;
      while ((j>0) && (s[j] < s[j-1])) {
        swap(&s[j],&s[j-1]);
        j = j-1;
      }
    }
  }
#+END_SRC 

Let's state clearly at the outset: YOU DO NOT HAVE TO KNOW WHAT THIS
MEANS IN YOUR LIFE! Just notice for now that it contains familiar words like "for" and
"item." And keep in mind that the person who "wrote" it most likely needed to do
what I am doing right now to accomplish the task: she had to type it on a
keyboard. 

PROBABLY OBVIOUS FACT STILL WORTH MENTIONING NOW:

A ton of computing revolves around typing "words" on a keyboard! 

Why does this matter? Because it should be reassuring that, in all
likelihood, you already know something about this! Let's balance this
reassuring fact out with something potentially less familiar and
reassuring:

Perhaps even more computing (in 2013) revolves around using something called a GUI...

Yikes! Things always run smoothly until the first unpronounceable
acronym appears. This one (pronounced "Gooey," as in warm chocolate
chip cookies) stands for Graphical User Interface. What the hell is
that? Well, if you have ever seen a typewriter (perhaps in an old
movie, if not in real life), you can think about everything that's
not the piece of paper or the typewriter itself. 

Huh?

One of the great revolutions in computing was the appearance of all
the things that made it less like typing and more like...something
else entirely. Words that had existed for centuries like "icon,"
"window," "menu," "desktop" (ok, maybe not centuries) all of sudden
were repurposed to refer to new "objects," objects which maybe had
parallels in the "real world" but now appeared to have a new existence
that was solely on the computer screen (the question of "existence" "on"
a computer is tricky on, needless to say). 

To avoid digressing into computing history, let's just say that today,
many people may find it difficult to imagine using a computer which lacked
these convenient things. Which thus brings us to one of the most important points so
far. 

As was said before, programming languages are our bridge between the familiar world of
natural language--which the "more intuitive," "natural" interface (or
GUI) of the modern personal computer serves to flesh out--and the
human-unreadable "gibberish" of machine language. While we do not
need to know programming languages to use free software, it doesn't
hurt to learn about them, or the things people do with them. And
here's the another important if not obvious fact: most programming languages are text-based. That
means that while GUI-elements like icons and windows may have been
involved in making the software that you want to use, the
key components the creator/writer had to grapple with were, typically, words and symbols, just like those one might clack
out on a typewriter.

Thus, anyone who wants to use more software in a more sophisticated
way, and especially anyone who has ever wanted to change software he
was using in ways that its proprietor did not make readily possible, will
need to become comfortable not just with the images and visual
elements of the GUI,
but with something as old-fashioned as letters and numbers and
obscure symbols like the caret and the asterisk. Not only that, but
such a person will eventually experience the power that a semicolon
can yield, and conversely, the frustration that an improperly placed
semicolon that cause. 

All of this has been taking us up to another crucial acronym: the
CLI, which, fittingly, lacks a cute pronounciation. It stands for a
Command-Line Interface. The key difference in interfaces here is between "Command-Line"
and "Graphical User." 

Once upon a time, (which this writer can
recall) computers were primarily accessed via something called
"terminals," which, in my case, had one stark user-interface feature: green text on a black background. Now, no
one should expect have to go back and learn what exactly was going on
during that era or what the relationship between a terminal and a
"mainframe" was. But it turns out that, to use open source software,
being comfortable at such a "terminal" interface--which we can think
of as a "command-line"--is actually quite useful. 

Now to all readers for whom the prospect of working with a
command-line interface is notably distressing, let me remind you of
the first big fact mentioned at the beginning: it's all still mostly
words on a keyboard (until it's all just
gestures on a touchscreen!). And so a good amount of what is required to get more
familiar with what goes on "inside" the software we want to use is to
get comfortable with the
underlying words and symbols that make up the menus and options of the GUI
sported by your piece of software of choice. 

Good news, again. 

Unless one is using a computer solely as a kind of enhanced
television (or as a subtitute game-console, recording studio or
multimedia canvas), the odds are high that you have spent significant
amounts of time typing text that
appeared on a screen. "Word processing," it turns out, is a good preparation for
learning more about what goes on inside your software. 

Now, for anybody who ever had an animated paperclip appear on that
screen to inform you of a problem in your writing, or for anybody who
ever had drafted an email which disappeared into the ether, there may
be some "baggage" loading down one's personal associations with "word
processing." Let us then turn our attention away from such a phrase
and think instead about a perhaps less loaded term: "text editing." 

:LOGBOOK:
CLOCK: [2013-10-22 Tue 14:09]--[2013-10-22 Tue 17:13] =>  3:04
:END:
[2013-10-22 Tue 14:09]
[[file:~/org/refile.org::*long-tones][long-tones]]

