young-ciceros-path.html

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> reflections about reading programming</h3>
<div class="outline-text-3" id="text-1-12">
<p>
One of the legimate complaints one might imagine hearing offered up
about the learning to program, orfiguring out something on the
computer, or just about the technological approach in general, is
that it is boring, alienating foregin, unintuive or unnatural
seeming.  It seems wise to acknowledge the legitmacy of tese
reactions rather than simply mount a defense, pure and simple. Would
that there were ways to present the neeed informatoin, to instill the
needed skills and ways fo thinking, ways to induce the kind of
mentality, that did not seem like brainwashing, that idd not require
putting to sleep parts of being that keep us alive, that serve to
make us who we are. We are in fact problem-solvers. We do relfect and
analyze. But we do not immediately apodt new new systems of
symbology. Learning new terms, and more importantly lerning the new
ways those terms are strung together to form significant
meanings&#x2013;none ofeahch of these things presents quite natural
problems, which are infrequently resolved to everyone's
satisfaction.  This may not seem significant, or rather may seem
simply the way it is, as it were. 
</p>

<p>
But if we are to move into a the coming intellectua and culutral age,
it strikes me that we would do well to examine the technological
approach in a new way, one that is sympathetic both to these kind of
plaints, but also to the misgivings about the larger import of the
project that they represent. 
</p>

<p>
Can you learn to program while reading Heidegger's QUestion
Concerning Technology? Is there some way to maintain a poet's
mentality while developing one's understanding of the syntax of
various computer languages? Can one be passionate about data, as an
artist is passionate about color, or chords? It's fair to sy that
each of these thoughts reveals an uneasy tension at the heart of
something like "digital humanities."
</p>

<p>
And yet, if they are to succeed, to remain relevant, they must find
ways to reconcile themselves to conditions which increasingly pervade
our conscioousness, which make up the fabric of the world which we
reflect on and think through artistically.  NOt with a sense of
having lost some battle, of resigning to the harsh technological reality of the
future, but with the desire to be there, shaping it, and particpating
and offering our voices. And gaining something in return. Expaniding
our awareness of the world around us, and possible ways to naviagte
thothrough that world. Becuase ultimately every profession must
implicitly make an argument for its continued survival, and
relevance. Surely there are many reasons why we would want to the
arts to persist, to "endure" and one of the simplest and most
effective ones is that they "help." What do they help us do? 'TO know
ourselves' has been a strong answer for an indeterminate period of
time. 
</p>

<p>
BUt now we can strive to supply another answer, one that can be more
bound up in and congnizant of whatever has been gained amid all the
tears toil and bloodshed of the "modern age." An art hwich only looks
selectively around it, which only sees what has been lost and what
has robbed will ultimately ring hollow, as people fail to identify
with the sense of loss in their continued existence out on the plain
of the future,  in the sanctuary of they make of the now.
</p>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> putting the "source" in open source</h3>
<div class="outline-text-3" id="text-1-13">
<p>
One of the things that explains the lengths I am going through here is
that to gain a deeper understanding of open source it helps to be able
to know something about what the "source" refers to exactly. 
</p>

<p>
Understanding 'source' actually entails understanding something of the
underlying instructions that make the programs we want to run do what
we want them to do. This requires developing an understanding of a
computer language, the one that your program is written in. But, as
with learning any language, you'd have to devote a considerable amount
of time and effort to learning, say, Python, well enough to be able
know what the source is "doing."  So, if you just want the effect that
the source provides, you may not ever feel compelled to actually begin
the process of learning the language
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: WORZONE</p>
<p class="date">Created: 2013-12-16 Mon 21:06</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.0.7)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
